uat_chat/DataProcessors/уатЗначенияСвойствОбъекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>уатЗначенияСвойствОбъекта</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НазначениеСвойств</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.уатНазначенияСвойствКатегорийОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектОтбораЗначений</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектОтбораНазначений</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.уатНазначенияСвойствКатегорийОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СвойстваИЗначения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.уатСвойстваОбъектов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПометкаУдаления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.уатСвойстваОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

uat_chat/InformationRegisters/уатЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>уатЗначенияСвойствОбъектов</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.уатСвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.уатСвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

uat_chat/DataProcessors/уатЗначенияСвойствОбъекта/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПрочитатьТаблицуСвойствИЗначений()
	
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("НазначениеСвойств",       ?(НазначениеСвойств = Неопределено, уатОбщегоНазначения.уатПолучитьСписокНазначенийСвойствКатегорийОбъектовПоСсылке(ОбъектОтбораЗначений), НазначениеСвойств));
	Запрос.УстановитьПараметр("ОбъектОтбораЗначений",    ОбъектОтбораЗначений);
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	СвойстваОбъектов.Наименование                               КАК СвойстваОбъектовНаименование,
	|	СвойстваОбъектов.ПометкаУдаления                            КАК ПометкаУдаления,
	|	СвойстваОбъектов.Ссылка                                     КАК Свойство,
	|	РегистрСведений.уатЗначенияСвойствОбъектов.Значение            КАК Значение
	|
	|ИЗ
	|// Отбираются свойства, предназначенные для заданного типа объектов.
	|	(
	|	ВЫБРАТЬ 
	|		ПланВидовХарактеристик.уатСвойстваОбъектов.Ссылка          КАК Ссылка,
	|		ПланВидовХарактеристик.уатСвойстваОбъектов.Наименование    КАК Наименование,
	|		ПланВидовХарактеристик.уатСвойстваОбъектов.ПометкаУдаления КАК ПометкаУдаления
	|
	|	ИЗ
	|		ПланВидовХарактеристик.уатСвойстваОбъектов
	|
	|	ГДЕ
	|		ПланВидовХарактеристик.уатСвойстваОбъектов.НазначениеСвойства В ( &НазначениеСвойств )
	|
	|	)                                                           КАК СвойстваОбъектов
	|
	|ЛЕВОЕ ВНЕШНЕЕ СОЕДИНЕНИЕ
	|// Присоединяются значения свойств, назначенные для заданного объекта.
	|	РегистрСведений.уатЗначенияСвойствОбъектов
	|ПО
	|	РегистрСведений.уатЗначенияСвойствОбъектов.Свойство = СвойстваОбъектов.Ссылка
	|	И
	|	РегистрСведений.уатЗначенияСвойствОбъектов.Объект = &ОбъектОтбораЗначений
	|
	|УПОРЯДОЧИТЬ ПО
	|	СвойстваОбъектовНаименование
	|";
	
	ТабЗн = Запрос.Выполнить().Выгрузить();
	ТабЗн.Колонки.Удалить(0);
	
	Возврат ТабЗн;
	
КонецФункции

// Процедура заполняет табличную часть обработки свойствами и значениями свойств объекта.
// При заполнении используются значения реквизитов обработки: 
// ОбъектОтбораЗначений - объект, значения свойств которого отбираются.
// НазначениеСвойств - значение реквизита, по которому отбираются свойства.
//
// Параметры:
//  Нет.
//
Процедура ПрочитатьЗаполнитьСвойстваИЗначения() Экспорт

	СвойстваИЗначения.Загрузить(ПрочитатьТаблицуСвойствИЗначений());

КонецПроцедуры

// Процедура открывает форму нового свойства.
// Предназначена для вызова из обработчиков форм СвойстваИЗначенияПередНачаломДобавления.
//
// Параметры:
//  Нет.
//
Процедура ОткрытьФормуНовогоСвойства(ФормаВладелец, Элемент = Неопределено, Копирование = Ложь) Экспорт

	ФормаНовогоСвойства = ПланыВидовХарактеристик.уатСвойстваОбъектов.ПолучитьФормуНовогоЭлемента(, ФормаВладелец, );
	
	Если Копирование И ЗначениеЗаполнено(Элемент.ТекущиеДанные) И ЗначениеЗаполнено(Элемент.ТекущиеДанные.Свойство) Тогда
		
		ФормаНовогоСвойства.НазначениеСвойства = Элемент.ТекущиеДанные.Свойство.НазначениеСвойства;
		ФормаНовогоСвойства.Наименование = Элемент.ТекущиеДанные.Свойство.Наименование;
		ФормаНовогоСвойства.ТипЗначения  = Элемент.ТекущиеДанные.Свойство.ТипЗначения;
	Иначе
		
		НазначениеСвойств = уатОбщегоНазначения.уатПолучитьСписокНазначенийСвойствКатегорийОбъектовПоСсылке(ОбъектОтбораЗначений);
		Если НазначениеСвойств.Количество() > 1  Тогда
			ВыбранныйЭлемент = НазначениеСвойств.ВыбратьЭлемент("Выбор назначения свойства");

			Если ВыбранныйЭлемент <> Неопределено Тогда
				ФормаНовогоСвойства.НазначениеСвойства = ВыбранныйЭлемент.Значение;
			КонецЕсли;

		ИначеЕсли НазначениеСвойств.Количество() = 1  Тогда
			 
			ФормаНовогоСвойства.НазначениеСвойства = НазначениеСвойств[0].Значение;
			
		КонецЕсли;
		
	КонецЕсли;

	ФормаНовогоСвойства.Открыть();

КонецПроцедуры

// Процедура проверяет, должно ли новое свойство попасть в табличную часть обработки, 
// если да - добавляет свойство и активизирует соответствующую строку в табличном поле.
// Предназначена для вызова из обработчиков форм ОбработкаЗаписиНовогоОбъекта.
//
// Параметры:
//  Свойство - добавляемое свойство.
//  ТабличноеПоле - ТабличноеПоле, в котором надо активизировать строку.
//
Процедура ПроверитьДобавитьНовоеСвойство(Свойство, ТабличноеПоле) Экспорт

	// Запросом проверяется, должно ли новое свойство быть отобрано в табличную часть.

	Запрос = Новый Запрос();

	Запрос.УстановитьПараметр("Свойство",                Свойство);
	Запрос.УстановитьПараметр("НазначениеСвойств",       НазначениеСвойств);

	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СвойстваОбъектов.Ссылка                                     КАК Свойство
	|
	|ИЗ
	|// Отбирается свойство.
	|	(
	|	ВЫБРАТЬ 
	|		ПланВидовХарактеристик.уатСвойстваОбъектов.Ссылка          КАК Ссылка
	|
	|	ИЗ
	|		ПланВидовХарактеристик.уатСвойстваОбъектов
	|
	|	ГДЕ
	|		ПланВидовХарактеристик.уатСвойстваОбъектов.НазначениеСвойства В ( &НазначениеСвойств )
	|		И
	|		ПланВидовХарактеристик.уатСвойстваОбъектов.Ссылка             = &Свойство
	|
	|	)                                                           КАК СвойстваОбъектов
	|";

	Если Запрос.Выполнить().Пустой() Тогда
		Возврат;
	КонецЕсли;

	// Определение позиции свойства в табличной части.

	Для Индекс = 0 По СвойстваИЗначения.Количество() - 1 Цикл
		Если Свойство.Наименование < СвойстваИЗначения[Индекс].Свойство.Наименование Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;

	// Вставка свойства с соответствующую позицию.

	НоваяСтрока = СвойстваИЗначения.Вставить(Индекс);

	НоваяСтрока.ПометкаУдаления = Свойство.ПометкаУдаления;
	НоваяСтрока.Свойство        = Свойство;

	// Позиционирование курсора.

	ТабличноеПоле.ТекущаяСтрока  = НоваяСтрока;

КонецПроцедуры

// Процедура снимает и устанавливает пометку удаления свойства.
// Предназначена для вызова из обработчиков форм СвойстваИЗначенияПередУдалением.
//
// Параметры:
//  ТекущаяСтрока - текущая строка табличной части.
//
Процедура ИнвертироватьПометкуУдаленияСвойства(ТекущаяСтрока) Экспорт

	ОбъектСвойство = ТекущаяСтрока.Свойство.ПолучитьОбъект();

	Если ОбъектСвойство.Предопределенный Тогда
		Сообщить("Не допускается удаление предопределенных элементов!",СтатусСообщения.Внимание);
		Возврат;
	КонецЕсли;

	Попытка
		ОбъектСвойство.УстановитьПометкуУдаления(НЕ ТекущаяСтрока.ПометкаУдаления, Истина);
	Исключение
		#Если Клиент Тогда
			Предупреждение("Не удалось изменить пометку удаления свойства:" + Символы.ПС + ОписаниеОшибки());
		#КонецЕсли
	КонецПопытки;

	ТекущаяСтрока.ПометкаУдаления = ОбъектСвойство.ПометкаУдаления;

КонецПроцедуры

// Процедура приводит тип значения значения свойства к требуемому типу.
// Предназначена для вызова из обработчиков форм 
// СвойстваИЗначенияПриНачалеРедактирования, СвойстваИЗначенияЗначениеОчистка.
//
// Параметры:
//  Нет.
//
Процедура ПривестиТипЗначенияСвойства(ТекущаяСтрока, ЭлементУправления) Экспорт
	
	ТипЗначенияСвойства = ТекущаяСтрока.Свойство.ТипЗначения;
	ЭлементУправления.ОграничениеТипа = ТипЗначенияСвойства;
	ТекущаяСтрока.Значение = ТипЗначенияСвойства.ПривестиЗначение(ТекущаяСтрока.Значение);
	
КонецПроцедуры

// Процедура вызывается при выводе строки табличного поля "Свойства и значения"
// отображает пометку удаления и требуемый формат
//
Процедура ПриВыводеСтрокиСвойствИЗначений(Элемент, ОформлениеСтроки, ДанныеСтроки) Экспорт
	
	Если Элемент.Колонки.Найти("ПометкаУдаления") <> Неопределено И Элемент.Колонки.ПометкаУдаления.Видимость Тогда
		
		ОформлениеСтроки.Ячейки.ПометкаУдаления.ОтображатьКартинку = Истина;
		ОформлениеСтроки.Ячейки.ПометкаУдаления.ИндексКартинки     = Число(ДанныеСтроки.ПометкаУдаления) + 1;
		
	КонецЕсли;
	
	Если ТипЗНЧ(ДанныеСтроки.Значение) = Тип("Дата") Тогда
		
		Если ДанныеСтроки.Свойство.ТипЗначения.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.Дата Тогда
			ОформлениеСтроки.Ячейки.Значение.Текст = Формат(ДанныеСтроки.Значение, "ДФ=dd.MM.yyyy") 
		ИначеЕсли ДанныеСтроки.Свойство.ТипЗначения.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.Время Тогда
			ОформлениеСтроки.Ячейки.Значение.Текст = Формат(ДанныеСтроки.Значение, "ДФ=ЧЧ:мм:сс") 
		КонецЕсли;
		
	ИначеЕсли ТипЗНЧ(ДанныеСтроки.Значение) = Тип("Число") Тогда
		
		ОформлениеСтроки.Ячейки.Значение.Текст = Формат(ДанныеСтроки.Значение, "ЧДЦ=" + ДанныеСтроки.Свойство.ТипЗначения.КвалификаторыЧисла.РазрядностьДробнойЧасти) 
		
	ИначеЕсли ДанныеСтроки.Свойство.ТипЗначения.СодержитТип(Тип("Булево"))
		И ДанныеСтроки.Свойство.ТипЗначения.Типы().Количество() = 1 Тогда
		
		ОформлениеСтроки.Ячейки.Значение.ОтображатьТекст  = Ложь;
		ОформлениеСтроки.Ячейки.Значение.ОтображатьФлажок = Истина;
		ОформлениеСтроки.Ячейки.Значение.ТолькоПросмотр   = Истина;
		ОформлениеСтроки.Ячейки.Значение.Флажок           = ДанныеСтроки.Свойство.ТипЗначения.ПривестиЗначение(ДанныеСтроки.Значение);
	КонецЕсли;
	
КонецПроцедуры // () 

// Функция записывает значения свойств в информационную базу.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Истина - если значения свойств были записаны, или их не требуется записывать
//  Ложь   - если значения свойств не удалось записать.
//
Функция ЗаписатьЗначенияСвойств() Экспорт
	
	НаборЗаписейЗначенияСвойств = РегистрыСведений.уатЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
	
	Для каждого Строка Из СвойстваИЗначения Цикл
		Если ЗначениеЗаполнено(Строка.Значение) И Строка.Значение <> Ложь Тогда
			Запись = НаборЗаписейЗначенияСвойств.Добавить();
			
			Запись.Объект   = ОбъектОтбораЗначений;
			Запись.Свойство = Строка.Свойство;
			Запись.Значение = Строка.Значение;
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписейЗначенияСвойств.Отбор.Объект.Установить(ОбъектОтбораЗначений);
	
	Попытка
		НаборЗаписейЗначенияСвойств.Записать();
	Исключение
		#Если Клиент Тогда
			Предупреждение("Не удалось записать значения свойств:" + Символы.ПС + ОписаниеОшибки());
		#КонецЕсли
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции
